<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of 1Password and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.macsolution.seedstore.munki.1Password</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>%MUNKI_CATEGORY%/%NAME%</string>
		<key>MUNKI_CATEGORY</key>
		<string>Tools</string>
		<key>NAME</key>
		<string>1Password</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>1Password Updater.app</string>
				<string>1Password Helper (GPU).app</string>
				<string>1Password Browser Helper.app</string>
				<string>1Password Helper (Renderer).app</string>
				<string>1Password Helper.app</string>
				<string>1Password Helper (Plugin).app</string>
				<string>1Password.app</string>
				<string>1Password Launcher.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>icon_name</key>
  			<string>1Password.png</string>
			<key>description</key>
			<string>A password manager, digital vault, form filler and secure digital wallet. Manage everything in one safe place!</string>
			<key>developer</key>
			<string>AgileBits Inc.</string>
			<key>display_name</key>
			<string>1Password</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.macsolution.seedstore.download.1Password</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
